taste_buds_api/app/controllers/api/v1/recipes_controller.rb

    def index
        recipes = Recipe.order created_at: :desc
---
SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."created_at" DESC

    def show
        @recipe = Recipe.find params[:id]
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]

    def create
        recipe = Recipe.new recipe_params
        recipe.user = current_user
        if recipe.save
---
INSERT INTO "recipes" ("image_url", "title", "story", "description", "serving_size", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def destroy
        @recipe = Recipe.find params[:id]
        if @recipe.destroy
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 11]]