taste_buds_api/app/controllers/api/v1/reviews_controller.rb

    def create
        @recipe = Recipe.find params[:recipe_id]
        review = Review.new review_params
        review.recipe = @recipe
        review.user = current_user
        if review.save
---
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "reviews" ("body", "rating", "recipe_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body", "very tasty and aromatic curry"], ["rating", 5], ["recipe_id", 2], ["created_at", "2021-07-05 23:02:19.988614"], ["updated_at", "2021-07-05 23:02:19.988614"], ["user_id", 12]]

      def destroy
        @review= Review.find params[:id]
        if @review.destroy
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 84], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = $1  [["id", 84]]